import 'package:flutter/material.dart';

import '../../model/item_model.dart';
import '../../model/result_model.dart';
import '../../model/scale_model.dart';

class OCD {
  //
  static String title = 'Obsessive Compulsive Scale';
  static String slug = 'obsessive-compulsive-scale';
  static String route = 'ocd';
  static String author =
      'Developed by: Md. Kamruzzaman Mozumder and Dr. Roquia Begum, Clinical Psychology, University of Dhaka';

  //
  static String about =
      'ঢাকা বিশ্ববিদ্যালয় অবসেসিভ কমপালসিভ স্কেল (DUOCS) তৈরি করা হয়েছে ব্যক্তিদের মধ্যে অবসেসিভ-কমপালসিভ ডিসঅর্ডার (OCD) এর লক্ষণগুলোর প্রকৃতি এবং তীব্রতা পরিমাপের জন্য। এটি অবসেসিভ চিন্তা, কমপালসিভ আচরণ এবং সেগুলো দ্বারা সৃষ্ট মানসিক ক্লেশের মাত্রা ও ঘনত্ব মূল্যায়ন করে।';

  //
  static String instruction =
      'প্রশ্নে উল্লিখিত অনুভুতি এবং ভাবনাগুলো গত এক মাসে আপনার মধ্যে কি পরিমানে ঘটেছে তা পাঁচটি উত্তরের মধ্যে উপযুক্ত ঘর চিহ্নিত করুন';

  //
  static List<ItemModel> items = [
    ItemModel(
      id: 1,
      title:
          'আমার মাথায় ধর্ম নিয়ে নানান ধরনের অদ্ভুত এবং বাজে চিন্তা আসে যা আমি চাইলেও থামাতে পারি না।',
      scale: scale,
    ),
    ItemModel(
      id: 2,
      title:
          'পবিত্র স্থানকে অপবিত্র করছি এমন কল্পনা বা ছবি আসে মনে, আমি চাইলেও তা মন থেকে সরাতে পারিনা।',
      scale: scale,
    ),
    ItemModel(
      id: 3,
      title:
          'নাস্তিকতাবাদী চিন্তা আমার মনের মধ্যে এত বার বার আসতে থাকে যে মনে হয় আমার ঈমান (সৃষ্টিকর্তার প্রতি বিশ্বাস) নেই বা নষ্ট হয়ে গেছে।',
      scale: scale,
    ),
    ItemModel(
      id: 4,
      title: 'সারাক্ষণ সন্দেহ হয় আমি বুঝি নাপাক, নোংরা, বা অশুচি হয়ে গেছি।',
      scale: scale,
    ),
    ItemModel(
      id: 5,
      title: 'সারাক্ষণ মনে হয় আমার গায়ে-হাতে ময়লা বা জীবাণু লেগে আছে।',
      scale: scale,
    ),
    ItemModel(
      id: 6,
      title:
          'কোন কিছু পরিস্কার করার সময় অনেকবার বা অনেক সময় লাগিয়ে ধুই, যদিও বুঝি এতবার ধোয়ার দরকার নেই, কিন্তু না ধুয়ে পারি না।',
      scale: scale,
    ),
    ItemModel(
      id: 7,
      title:
          'পরিস্কার পরিচ্ছন্নতার জন্য আমাকে প্রচুর পরিমান সাবান বা ডিটারজেন্ট পাউডার ব্যাবহার করতে হয়।',
      scale: scale,
    ),
    ItemModel(
      id: 8,
      title:
          'যেখানে নোংরা থাকতে পারে ঐসব স্থান সম্পর্কে আমি অতিরিক্ত সচেতন থাকি এবং প্রায়শই এড়িয়ে চলি।',
      scale: scale,
    ),
    ItemModel(
      id: 9,
      title:
          'আমার গায়ে কারো স্পর্শ লাগলে আমি গোসল বা পরিস্কার না হওয়া পর্যন্ত অশান্তিতে ভুগতে থাকি।',
      scale: scale,
    ),
    ItemModel(
      id: 10,
      title: 'গোসল করতে আমার প্রচুর সময় এমনকি কয়েক ঘন্টাও লেগে যায়।',
      scale: scale,
    ),
    ItemModel(
      id: 11,
      title:
          'কোন কাজ করার মাঝে যদি আমার মনে চিন্তা আসে যে আমি নাপাক হয়ে গেছি, তাহলে আমি তৎক্ষনাৎ গোসল বা পরিচ্ছন্ন হতে যাই।',
      scale: scale,
    ),
    ItemModel(
      id: 12,
      title: 'বিভিন্ন জিনিস আমি বারবার পরীক্ষা করে দেখি।',
      scale: scale,
    ),
    ItemModel(
      id: 13,
      title:
          'নামাজ/উপাসনা করতে গেলে সন্দেহ লাগে হয়তো সুরা/শ্লোক ঠিকমত পড়া হয়নি, তখন আবার পড়ি, এভাবে অনেক সময় লেগে যায়।',
      scale: scale,
    ),
    ItemModel(
      id: 14,
      title:
          'হিসাব করতে আমার খুব অসুবিধা হয়, শুধু মনে হয় বুঝি গোনায় ভুল হয়ে গেল।',
      scale: scale,
    ),
    ItemModel(
      id: 15,
      title: 'আমার মনের মত না হওয়া পর্যন্ত আমি একই কাজ বারবার করতে থাকি।',
      scale: scale,
    ),
    ItemModel(
      id: 16,
      title: 'বিভিন্ন জিনিস আমি একটি নির্দিষ্ট সংখ্যক বার করি।',
      scale: scale,
    ),
    ItemModel(
      id: 17,
      title:
          'প্রাত্যহিক কাজ করতে আমার প্রচুর সময় লাগে বা প্রায় কোন কাজই সময় মত করতে পারি না।',
      scale: scale,
    ),
    ItemModel(
      id: 18,
      title:
          'কোন কাজ করার সময় যদি আমার নির্ধারিত ধারাবাহিকতায় কোন ছেদ পড়ে বা বিঘ্ন ঘটে তবে সে কাজটি আমাকে আবার প্রথম থেকে শুরু করতে হয়।',
      scale: scale,
    ),
    ItemModel(
      id: 19,
      title:
          'আমি বুঝি আমি এমন কিছু আচরণ করি যা অতিরিক্ত এবং অপ্রয়োজনীয়, কিন্তু তারপরও না করে পারি না।',
      scale: scale,
    ),
    ItemModel(
      id: 20,
      title:
          'কিছু কিছু ব্যাপার নিয়ে আমি অতিরিক্ত খুঁতখুঁতে বলে অন্যরা প্রায়ই আমার উপর বিরক্ত হয়।',
      scale: scale,
    ),
  ];

  //
  static List<ScaleModel> scale = [
    ScaleModel(0, 'একেবারেই না'),
    ScaleModel(1, 'খুবই সামান্য'),
    ScaleModel(2, 'সামান্য'),
    ScaleModel(3, 'একটু বেশি'),
    ScaleModel(4, 'অনেক বেশি'),
  ];

  //
  static ResultModel calculateResult(int score) {
    if (score.clamp(0, 17) == score) {
      return OCD.result[0]; // High Stress
    }
    if (score.clamp(18, 23) == score) {
      return OCD.result[1]; // Low Stress
    } else if (score.clamp(24, 40) == score) {
      return OCD.result[2]; // Medium Stress
    } else if (score.clamp(41, 49) == score) {
      return OCD.result[3]; // High Stress
    } else if (score.clamp(50, 80) == score) {
      return OCD.result[4]; // High Stress
    } else {
      return ResultModel.empty();
    }
  }

  //
  static final List<ResultModel> result = [
    ResultModel(
      status: 'Normal',
      color: Colors.green,
      interpretation:
          'আপনার স্কোর নির্দেশ করে যে আপনি স্বাভাবিক অবস্থায় আছেন এবং আপনার মানসিক স্বাস্থ্য এই মুহূর্তে ভালো। তবে, মানসিক সুস্থতা বজায় রাখতে আপনার প্রতিদিনের অভ্যাস এবং জীবনযাত্রার প্রতি মনোযোগ দেওয়া গুরুত্বপূর্ণ।',
      suggestions:
          '১. নিয়মিত শারীরিক ব্যায়াম করুন এবং একটি স্বাস্থ্যকর খাদ্যাভ্যাস বজায় রাখুন।\n'
          '২. মানসিক প্রশান্তির জন্য ধ্যান বা শ্বাস প্রশ্বাসের অনুশীলন করুন।\n'
          '৩. আপনার কাজ ও বিশ্রামের মধ্যে ভারসাম্য বজায় রাখুন এবং মানসিক শান্তি উপভোগ করুন।',
    ),
    ResultModel(
      status: 'Mild OCD',
      color: Colors.amber,
      interpretation:
          'আপনার স্কোর নির্দেশ করে যে আপনার মৃদু স্তরের ওসিডি থাকতে পারে। এটি এখনই গুরুতর নয় তবে কিছু লক্ষণ দেখা দিতে পারে যা দৈনন্দিন জীবনে প্রভাব ফেলে। সচেতন হওয়া এবং সমস্যাটি সমাধানের জন্য প্রাথমিক পদক্ষেপ নেওয়া গুরুত্বপূর্ণ।',
      suggestions:
          '১. একটি রুটিন তৈরি করুন এবং কাজগুলোকে নির্ধারিত সময়ে সম্পন্ন করার চেষ্টা করুন।\n'
          '২. নিয়মিত মানসিক স্বাস্থ্য পেশাদারের সাথে পরামর্শ করুন।\n'
          '৩. চাপ কমানোর জন্য শখ বা প্রিয় কাজের সাথে সময় কাটান।',
    ),
    ResultModel(
      status: 'Moderate OCD',
      color: Colors.orange,
      interpretation:
          'আপনার স্কোর নির্দেশ করে যে আপনার মধ্যম স্তরের ওসিডি রয়েছে। এটি আপনার দৈনন্দিন কার্যকলাপকে প্রভাবিত করতে পারে এবং এটির প্রতি গুরুত্ব দেওয়া প্রয়োজন। মানসিক স্বাস্থ্য বিশেষজ্ঞের সাহায্যে আপনি এই অবস্থার উন্নতি করতে পারবেন।',
      suggestions:
          '১. মানসিক চাপ কমানোর জন্য ধ্যান এবং রিল্যাক্সেশন কৌশল ব্যবহার করুন।\n'
          '২. নেতিবাচক চিন্তাভাবনাকে চ্যালেঞ্জ করার জন্য কগনিটিভ বিহেভিয়ারাল থেরাপি (CBT) বিবেচনা করুন।\n'
          '৩. আপনার পরিবার এবং বন্ধুদের সাথে যোগাযোগ রাখুন এবং তাদের সমর্থন নিন।',
    ),
    ResultModel(
      status: 'Severe OCD',
      color: Colors.red.shade400,
      interpretation:
          'আপনার স্কোর নির্দেশ করে যে আপনার গুরুতর স্তরের ওসিডি রয়েছে। এটি আপনার জীবনযাত্রার মানকে উল্লেখযোগ্যভাবে প্রভাবিত করতে পারে। দ্রুত পদক্ষেপ নিয়ে একজন বিশেষজ্ঞের সাহায্য নেওয়া অত্যন্ত গুরুত্বপূর্ণ।',
      suggestions:
          '১. একটি মানসিক স্বাস্থ্য বিশেষজ্ঞের পরামর্শ নিন এবং প্রয়োজনীয় থেরাপি গ্রহণ করুন।\n'
          '২. আপনার চিন্তাভাবনা এবং আচরণকে বোঝার জন্য থেরাপি সেশন বা সাপোর্ট গ্রুপে যোগ দিন।\n'
          '৩. মানসিক চাপ কমানোর জন্য ধৈর্য ধরে এবং ধীরে ধীরে ওসিডি ট্রিগারগুলোর মুখোমুখি হতে শিখুন।',
    ),
    ResultModel(
      status: 'Profound OCD',
      color: Colors.red.shade800,
      interpretation:
          'আপনার স্কোর নির্দেশ করে যে আপনার অত্যন্ত গুরুতর স্তরের ওসিডি রয়েছে। এটি আপনার মানসিক এবং শারীরিক স্বাস্থ্যের উপর উল্লেখযোগ্য প্রভাব ফেলতে পারে। এটি ব্যবস্থাপনায় বিশেষজ্ঞ সহায়তা এবং একটি সুসংহত থেরাপি প্রয়োজন।',
      suggestions:
          '১. আপনার থেরাপিস্ট বা চিকিৎসকের নির্দেশনা অনুযায়ী একটি সুনির্দিষ্ট চিকিৎসা পরিকল্পনা অনুসরণ করুন।\n'
          '২. সাপোর্ট গ্রুপ বা ওসিডি বিশেষজ্ঞদের সাথে যুক্ত হয়ে অভিজ্ঞতা ভাগাভাগি করুন।\n'
          '৩. প্রতিদিন কিছুটা সময় নিজের জন্য রাখুন এবং ধৈর্য ধরে মানসিক শান্তি পুনরুদ্ধারে কাজ করুন।',
    ),
  ];
}
