import 'package:flutter/material.dart';

import '../../model/item_model.dart';
import '../../model/result_model.dart';
import '../../model/scale_model.dart';

class SelfEsteem {
  //
  static String title = 'Self Esteem';
  static String route = 'self-esteem';
  static String author = 'N/A';
  static String about =
      'সেলফ-এস্টিম বা আত্মসম্মান হলো একজন ব্যক্তির নিজের মূল্য বা যোগ্যতার সম্পর্কে সামগ্রিক ব্যক্তিগত মূল্যায়ন। এটি একটি জটিল ধারণা যা জিনগত, ব্যক্তিত্ব, জীবনের অভিজ্ঞতা এবং সামাজিক সম্পর্কের মতো বিভিন্ন বিষয়ের দ্বারা প্রভাবিত হয়। আত্মসম্মান গুরুত্বপূর্ণ কারণ এটি আমাদের চিন্তা-ভাবনা, আচরণ এবং সার্বিক মঙ্গলের ওপর গভীর প্রভাব ফেলে।';

  static String instruction =
      'আত্মমর্যাদা সম্পর্কিত ১০টি উক্তি রয়েছে। প্রতিটি উক্তি আপনার ক্ষেত্রে কতটুকু প্রযোজ্য তা ৪টি পছন্দ ক্রমের যেকোনো একটি চিহ্নিত করুন।';

  //
  static final List<ItemModel> items = [
    ItemModel(
      id: 1,
      title:
          'অন্যদের সাথে সমান মাপকাঠিতে বিচার করলে আমি মনে করি আমি একজন যোগ্য ব্যক্তি।',
      scale: scaleP,
    ),
    ItemModel(
      id: 2,
      title: 'আমি মনে করি আমার বেশ কিছু ভাল গুণ আছে।',
      scale: scaleP,
    ),
    ItemModel(
      id: 3,
      title: 'সামগ্রিক বিচারে আমার মনে করার প্রবণতা আছে যে আমি ব্যর্থ।',
      scale: scaleN,
    ),
    ItemModel(
      id: 4,
      title: 'বেশিরভাগ লোকের মতো আমিও বিভিন্ন কাজ করতে সক্ষম।',
      scale: scaleP,
    ),
    ItemModel(
      id: 5,
      title: 'আমার মনে হয় গর্ব করার মত আমার বেশি কিছু নেই।',
      scale: scaleN,
    ),
    ItemModel(
      id: 6,
      title: 'নিজের প্রতি আমার ইতিবাচক মনোভাব আছে।',
      scale: scaleP,
    ),
    ItemModel(
      id: 7,
      title: 'আমি নিজেকে নিয়ে মোটামুটি সন্তুষ্ট।',
      scale: scaleP,
    ),
    ItemModel(
      id: 8,
      title: 'আমার ইচ্ছে হয় আমি নিজের প্রতি আরও শ্রদ্ধাশীল হবো।',
      scale: scaleN,
    ),
    ItemModel(
      id: 9,
      title: 'মাঝে মাঝে আমার মনে হয় আমার মূল্য নেই।',
      scale: scaleN,
    ),
    ItemModel(
      id: 10,
      title: 'মাঝে মাঝে আমার মনে হয় আমি মোটেও ভালো নেই।',
      scale: scaleN,
    ),
  ];

  //1, 2, 4, 6, 7
  static List<ScaleModel> scaleP = [
    ScaleModel(3, 'সম্পূর্ণভাবে একমত'),
    ScaleModel(2, 'একমত'),
    ScaleModel(1, 'একমত নই'),
    ScaleModel(0, 'একেবারেই একমত নই'),
  ];

  //3, 5, 8, 9, 10
  static List<ScaleModel> scaleN = [
    ScaleModel(0, 'সম্পূর্ণভাবে একমত'),
    ScaleModel(1, 'একমত'),
    ScaleModel(2, 'একমত নই'),
    ScaleModel(3, 'একেবারেই একমত নই'),
  ];

  // cal
  static ResultModel calculateResult(int score) {
    if (score < 15) {
      return SelfEsteem.result[0];
    } else if (score.clamp(15, 25) == score) {
      return SelfEsteem.result[1];
    } else if (score > 25) {
      return SelfEsteem.result[2];
    } else {
      return ResultModel.empty();
    }
  }

  //
  static final List<ResultModel> result = [
    ResultModel(
      status: 'Low Self Esteem',
      color: Colors.red,
      interpretation:
          'আপনি আত্মবিশ্বাসহীনতায় ভুগছেন, যা আপনার দৈনন্দিন জীবনে নেতিবাচক প্রভাব ফেলতে পারে। আপনি নিজের প্রতি নেতিবাচক ধারণা পোষণ করেন এবং নিজের ক্ষমতা ও দক্ষতা নিয়ে সন্দিহান থাকতে পারেন। এতে করে আপনি নতুন চ্যালেঞ্জ গ্রহণ করতে ভয় পান বা নিজেকে গুটিয়ে রাখেন। এটি আপনার মানসিক স্বাস্থ্য এবং ব্যক্তিগত সম্পর্কের উপর প্রভাব ফেলতে পারে।',
      suggestions:
          '১. ইতিবাচক চিন্তার চর্চা শুরু করুন। প্রতিদিন এমন তিনটি কাজ লিখুন যেগুলো আপনি সফলভাবে সম্পন্ন করেছেন।\n'
          '২. আত্মবিশ্বাস বাড়ানোর জন্য ছোট ছোট লক্ষ্য নির্ধারণ করুন এবং সেগুলো পূরণ করার চেষ্টা করুন।\n'
          '৩. নিজেকে সঠিকভাবে মূল্যায়ন করতে শিখুন এবং অযথা নেতিবাচক সমালোচনা এড়িয়ে চলুন।\n'
          '৪. প্রয়োজনে একজন পরামর্শদাতার (কাউন্সেলর) সাহায্য নিন, যিনি আপনার আত্মবিশ্বাস পুনর্গঠন করতে সহায়তা করতে পারবেন।',
    ),
    ResultModel(
      status: 'Normal Self Esteem',
      color: Colors.amber,
      interpretation:
          'আপনি আত্মবিশ্বাসী এবং জীবনের বেশিরভাগ পরিস্থিতিতে স্থিতিশীল থাকেন। মাঝে মাঝে কিছু সমস্যায় সাময়িক বিচলিত হলেও আপনি সেগুলো কাটিয়ে উঠতে পারেন। আপনি অতিরিক্ত দুশ্চিন্তা করেন না এবং আপনার আশেপাশের মানুষদের সঙ্গে সুসম্পর্ক বজায় রাখেন। তবে মাঝে মাঝে কিছু চ্যালেঞ্জ মোকাবিলায় দ্বিধাগ্রস্ত হতে পারেন।',
      suggestions:
          '১. ইতিবাচক আত্মবিশ্বাস বজায় রাখার জন্য প্রতিদিন ধ্যান বা মেডিটেশন চর্চা করুন।\n'
          '২. আপনার অর্জনগুলোর প্রশংসা করুন এবং নিজের উন্নতিতে মনোযোগ দিন।\n'
          '৩. সময়মতো কাজ শেষ করার অভ্যাস গড়ে তুলুন এবং চাপ মুক্ত থাকার চেষ্টা করুন।\n'
          '৪. নিজের মূল্যায়ন করতে শিখুন, তবে নিজেকে সবসময় নতুন কিছু শেখার জন্য প্রস্তুত রাখুন।',
    ),
    ResultModel(
      status: 'High Self Esteem',
      color: Colors.green,
      interpretation:
          'আপনি অত্যন্ত আত্মবিশ্বাসী এবং নিজের প্রতি ইতিবাচক মনোভাব পোষণ করেন। দৈনন্দিন জীবনের চ্যালেঞ্জগুলোকে সহজেই মোকাবিলা করতে পারেন। আপনি নিজের আত্মমর্যাদা অনুভব করেন এবং নিজেকে যেভাবে আছেন, সেভাবেই গ্রহণ করেন। আপনি নতুন চ্যালেঞ্জ গ্রহণ করতে পছন্দ করেন এবং অন্যদের সঙ্গে সুসম্পর্ক বজায় রাখতে সক্ষম।',
      suggestions:
          '১. আপনার আত্মবিশ্বাস বজায় রাখতে নিজের মানসিক ও শারীরিক সুস্থতার দিকে মনোযোগ দিন।\n'
          '২. নিজের অর্জনগুলো উদযাপন করুন, তবে অহংকার বা অতিরিক্ত আত্মপ্রশংসা এড়িয়ে চলুন।\n'
          '৩. অন্যদের জন্য অনুপ্রেরণা হয়ে উঠুন এবং যাদের আত্মবিশ্বাস কম, তাদের সহযোগিতা করুন।\n'
          '৪. নিয়মিত চ্যালেঞ্জ গ্রহণ করুন যা আপনাকে আরও দক্ষ এবং আত্মবিশ্বাসী করে তুলবে।',
    ),
  ];
}
