import 'package:flutter/material.dart';

import '../../model/item_model.dart';
import '../../model/result_model.dart';
import '../../model/scale_model.dart';

class SocialAnxiety {
  //
  static String title = 'Social Anxiety';
  static String route = 'social-anxiety';
  static String author = 'Developed by: La Greca & Lopez (1998)\n'
      'Adapted by: Najifa Alam, Oli Ahmed, Lutfun Naher, Fatema Akhter Hiramoni Psychology,University of Chittagong.';

  static String about =
      'সোশ্যাল অ্যাংজাইটি বা সামাজিক ভীতি হলো একটি মানসিক স্বাস্থ্য সমস্যা, যার মূল বৈশিষ্ট্য হলো সামাজিক পরিস্থিতিতে গভীর ও দীর্ঘস্থায়ী ভয়। যাদের সোশ্যাল অ্যাংজাইটি ডিসঅর্ডার থাকে, তারা সাধারণত এমন পরিস্থিতিতে যেখানে অন্যরা তাদের বিচার করবে ভেবে খুব বেশি উদ্বিগ্ন ও মানসিক চাপ অনুভব করেন, যেমন: উপস্থাপনা দেওয়া, নতুন মানুষের সাথে দেখা, বা পাবলিক প্লেসে খাওয়া-দাওয়া করা। এই ভয় এতটাই তীব্র হতে পারে যে তারা দৈনন্দিন জীবনযাত্রায় সমস্যায় পড়েন — যেমন কাজ বা স্কুলে যাওয়া, সম্পর্ক বজায় রাখা, এবং সামাজিক ক্রিয়াকলাপে অংশ নেওয়া কঠিন হয়ে পড়ে।';

  static String instruction =
      'সামাজিক আচরণ বিষয়ক বক্তব্য গুলো, আপনার ক্ষেত্রে মিল বা অমিলের ভিত্তিতে সত্য/মিথ্যা চিহ্নিত করুন।';

  //
  static List<ItemModel> items = [
    ItemModel(
      id: 1,
      title: 'আমি অপরিচিত সামাজিক পরিবেশেও স্বচ্ছন্দ বোধ করি।,',
      scale: scale,
    ),
    ItemModel(
      id: 2,
      title:
          'সামাজিকতা মানতে বাধ্য করে এমন অবস্থা আমি এড়িয়ে চলতে চেষ্টা করি।',
      scale: scale,
    ),
    ItemModel(
      id: 3,
      title: 'অপরিচিত লোকের মাঝেও আমি স্বচ্ছন্দ বোধ করি।',
      scale: scale,
    ),
    ItemModel(
      id: 4,
      title: 'মানুষকে এড়িয়ে চলার পিছনে আমার কোন বিশেষ উদ্দেশ্য নেই।',
      scale: scale,
    ),
    ItemModel(
      id: 5,
      title: 'আমি প্রায়ই সামাজিক অনুষ্ঠান সমূহকে বিশৃঙ্খল দেখি।',
      scale: scale,
    ),
    ItemModel(
      id: 6,
      title: 'আমি সাধারণত সামাজিক অনুষ্ঠানে স্বচ্ছন্দ বোধ করি।',
      scale: scale,
    ),
    ItemModel(
      id: 7,
      title: 'আমি বিপরীত লিঙ্গের কারো সাথে কথোপকথনের সময় সাধারণত সহজ থাকি।',
      scale: scale,
    ),
    ItemModel(
      id: 8,
      title:
          'আমি ভালোভাবে কাউকে না জানা পর্যন্ত তাদের সাথে কথোপকথন এড়িয়ে চলি।',
      scale: scale,
    ),
    ItemModel(
      id: 9,
      title:
          'যদি কোন নতুন ব্যক্তির সাথে পরিচয়ের সুযোগ আসে তাহলে আমি প্রায়ই তা গ্রহণ করি।',
      scale: scale,
    ),
    ItemModel(
      id: 10,
      title:
          'পুরুষ ও মহিলা উভয়ের উপস্থিতিতে কোন ঘরোয়া প্রীতি সম্মেলনে যোগদান করতে আমি ভীষণ ভাবে নার্ভাস বোধ করি।',
      scale: scale,
    ),
    ItemModel(
      id: 11,
      title:
          'ভালোভাবে কাউকে না জেনে লোকজনের সাথে মিশতে আমি সাধারণত নার্ভাস হয়ে পড়ি।',
      scale: scale,
    ),
    ItemModel(
      id: 12,
      title: 'আমি সাধারণত অনেক লোকের সাথে থাকতে স্বচ্ছন্দ বোধ করি।',
      scale: scale,
    ),
    ItemModel(
      id: 13,
      title: 'আমি প্রায়ই লোকজন থেকে দূরে থাকতে চাই।',
      scale: scale,
    ),
    ItemModel(
      id: 14,
      title: 'অপরিচিত কোন লোকজনের সাথে থাকতে আমি সাধারণত নার্ভাস হয়ে পড়।',
      scale: scale,
    ),
    ItemModel(
      id: 15,
      title: 'কারো সাথে প্রথম পরিচয়ে আমি স্বচ্ছন্দ বোধ করি।',
      scale: scale,
    ),
    ItemModel(
      id: 16,
      title: 'কারো সাথে পরিচিত হওয়ার সময় আমি উত্তেজিত ও নার্ভাস হয়ে পড়ি।',
      scale: scale,
    ),
    ItemModel(
      id: 17,
      title: 'ঘর ভর্তি অপরিচিত লোকের মধ্যে আমি যে কোনভাবেই প্রবেশ করতে পারি।',
      scale: scale,
    ),
    ItemModel(
      id: 18,
      title: 'আমি নিজ ইচ্ছায় কোনো বড় সমাবেশে যোগদান করি না।',
      scale: scale,
    ),
    ItemModel(
      id: 19,
      title:
          'বয়োজ্যেষ্ঠরা যখন আমার সাথে কথা বলতে চান তখন আমি আগ্রহ ভরে তাদের সাথে কথা বলি।',
      scale: scale,
    ),
    ItemModel(
      id: 20,
      title:
          'আমি যখন একদল লোকের মাঝে থাকি তখন প্রায়ই আমার মনে হয় আমি যেন কিনারে দাঁড়িয়ে আছি।',
      scale: scale,
    ),
    ItemModel(
      id: 21,
      title: 'আমি লোকজন থেকে নিজেকে দূরেও সরিয়ে রাখতে ভালোবাসি।',
      scale: scale,
    ),
    ItemModel(
      id: 22,
      title:
          'কোন ঘরোয়া বা সামাজিক অনুষ্ঠানে লোকজনের সাথে কথা বলতে আমি সংকোচ বোধ করিনা।',
      scale: scale,
    ),
    ItemModel(
      id: 23,
      title: 'আমি বড় কোন সমাবেশে কদাচিৎ সহজ হতে পারি।',
      scale: scale,
    ),
    ItemModel(
      id: 24,
      title: 'সামাজিক কোন অনুষ্ঠান এড়াতে আমি প্রায়ই অজুহাত খুঁজি।',
      scale: scale,
    ),
    ItemModel(
      id: 25,
      title:
          'লোকজনের সাথে পরস্পর পরিচয় করিয়ে দিতে আমি কখনও কখনও দায়িত্ব গ্রহণ করে থাকি।',
      scale: scale,
    ),
    ItemModel(
      id: 26,
      title: 'আনুষ্ঠানিক কোনে সামাজিক অনুষ্ঠান আমি এড়াতে চেষ্টা করি।',
      scale: scale,
    ),
    ItemModel(
      id: 27,
      title: 'আমি সাধারণত সব ধরণের সামাজিক অনুষ্ঠানে যাই।',
      scale: scale,
    ),
    ItemModel(
      id: 28,
      title: 'আমি সহজে অপরের সাথে মিলে আনন্দ উপভোগ করি।',
      scale: scale,
    ),
  ];

  //
  static List<ScaleModel> scale = [
    ScaleModel(0, 'সত্য'),
    ScaleModel(1, 'মিথ্যা'),
  ];

  // cal
  static ResultModel calculateResult(int score) {
    if (score.clamp(0, 1) == score) {
      return SocialAnxiety.result[0];
    } else if (score.clamp(2, 11) == score) {
      return SocialAnxiety.result[1];
    } else {
      return SocialAnxiety.result[2];
    }
  }

  // res
  static final List<ResultModel> result = [
    ResultModel(
      status: 'Low Social Anxiety',
      color: Colors.green,
      interpretation:
          'সামাজিক পরিস্থিতিতে আপনি খুব কম মাত্রার উদ্বেগ প্রকাশ করেন, যা অন্যদের সাথে যোগাযোগে স্বাচ্ছন্দ্য এবং আত্মবিশ্বাসের প্রতিফলন। আপনি সহজেই কথা শুরু করতে এবং নিজেকে দৃঢ়ভাবে উপস্থাপন করতে পারেন, যা একটি ইতিবাচক সামাজিক মনোভাব নির্দেশ করে।',
      suggestions:
          'আপনার সামাজিক আত্মবিশ্বাস আরও বাড়ানোর জন্য ধীরে ধীরে আপনার সামাজিক পরিধি বাড়ান এবং নতুন সামাজিক কার্যক্রমে অংশগ্রহণ করুন। নিজের প্রতি ইতিবাচক কথা বলার অভ্যাস গড়ে তুলুন এবং নির্ভীকতার কৌশল অনুশীলন করুন।',
    ),
    ResultModel(
      status: 'Average Social Anxiety',
      color: Colors.amber,
      interpretation:
          'সামাজিক পরিস্থিতিতে মাঝে মাঝে উদ্বেগ অনুভব করেন, যা মাঝারি মাত্রার সামাজিক উদ্বেগ নির্দেশ করে। এর পরও আপনি কথোপকথনে অংশগ্রহণ করার চেষ্টা করেন এবং অন্যদের মতামত গ্রহণের মানসিকতা রাখেন, যা সামাজিক যোগাযোগ চালিয়ে যাওয়ার ইচ্ছার পরিচায়ক।',
      suggestions:
          'আপনার সামাজিক উদ্বেগ নিয়ন্ত্রণে রাখতে প্রতিদিন শ্বাস-প্রশ্বাসের ব্যায়াম বা মননশীলতা (mindfulness) অনুশীলন করুন। কঠিন সামাজিক পরিস্থিতির ধীরে ধীরে মুখোমুখি হোন এবং নিজেকে সহানুভূতিশীল মনোভাব রাখুন। বিশ্বাসযোগ্য ব্যক্তিদের সহায়তা নিন এবং প্রয়োজনে মানসিক বিশেষজ্ঞের পরামর্শ গ্রহণ করুন।',
    ),
    ResultModel(
      status: 'High Social Anxiety',
      color: Colors.red,
      interpretation:
          'সামাজিক পরিস্থিতিতে আপনি উল্লেখযোগ্য মাত্রার উদ্বেগ অনুভব করেন, যার ফলে সামাজিক যোগাযোগ এড়িয়ে চলা এবং স্বতঃস্ফূর্ততা কমে যায়। এই উচ্চ মাত্রার সামাজিক উদ্বেগ আপনার জীবনের বিভিন্ন ক্ষেত্রে প্রভাব ফেলতে পারে, যার ফলে আলাদা হওয়ার অনুভূতি এবং অস্বস্তি দেখা দেয়।',
      suggestions:
          'আপনার উচ্চ সামাজিক উদ্বেগ মোকাবিলার জন্য নিজেকে যত্ন নিন এবং উদ্বেগ সম্পর্কিত থেরাপিতে বিশেষজ্ঞ মানসিক স্বাস্থ্য বিশেষজ্ঞের সাহায্য নিন। সামাজিক পরিস্থিতি নিয়ে নেতিবাচক চিন্তাধারা চ্যালেঞ্জ করুন এবং বিশ্বাসযোগ্য ব্যক্তিদের সহযোগিতায় ধীরে ধীরে সামাজিক পরিবেশে নিজেকে নিয়ে আসুন। শিথিলকরণ কৌশল অনুশীলন করুন এবং কার্যকর মোকাবিলা পদ্ধতির জন্য সিবিটি (Cognitive Behavioral Therapy) বিবেচনা করুন।',
    ),
  ];
}
